use theater

-- Заполнение таблицы theater данными
INSERT INTO dbo.theater (name, address, phone, director) 
VALUES 
    ('Театр им. А.С. Пушкина', 'ул. Тверская, 25, Москва', '+7 (495) 123-45-67', 'Иванов Иван Иванович'),
    ('Театр на Таганке', 'ул. Земляной Вал, 76, Москва', '+7 (495) 987-65-43', 'Петров Петр Петрович'),
    ('Театр им. Вл. Маяковского', 'ул. Большая Тверская, 35, Москва', '+7 (495) 111-22-33', 'Сидоров Сидор Сидорович');

-- Заполнение таблицы play данными
INSERT INTO dbo.play (name, stage_director, id_theater) 
VALUES 
    ('Гамлет', 'Иванов Иван Иванович', 1),
    ('Три сестры', 'Петров Петр Петрович', 2),
    ('Дождь', 'Сидоров Сидор Сидорович', 3);

-- Заполнение таблицы composition данными
INSERT INTO dbo.composition (name, author, type) 
VALUES 
    ('Гамлет', 'Уильям Шекспир', 'трагедия'),
    ('Три сестры', 'Антон Чехов', 'драма'),
    ('Дождь', 'Иван Тургенев', 'драма');

-- Заполнение таблицы composition_to_play данными
INSERT INTO dbo.composition_to_play (id_composition, id_play) 
VALUES 
    (1, 1),
    (2, 2),
    (3, 3);

-- Заполнение таблицы actor данными
INSERT INTO dbo.actor (name, age, phone_number) 
VALUES 
    ('Иванов Иван Иванович', 35, '+7 (901) 111-22-33'),
    ('Петров Петр Петрович', 40, '+7 (901) 222-33-44'),
    ('Сидоров Сидор Сидорович', 45, '+7 (901) 333-44-55');

-- Заполнение таблицы play_to_actor данными
INSERT INTO dbo.play_to_actor (id_play, id_actor) 
VALUES 
    (1, 1),
    (2, 2),
    (3, 3);

-- Заполнение таблицы ticket данными
INSERT INTO dbo.ticket (price, room_type, place_number, id_play, starting_date) 
VALUES 
    (1000, 'партер', 15, 1, '2024-04-10 18:00:00'),
    (800, 'бельэтаж', 25, 2, '2024-04-15 19:00:00'),
    (1200, 'партер', 30, 3, '2024-04-20 20:00:00');
